jmeter/test-plans/access-log.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="3.2" jmeter="3.2 r1790748">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Test Plan" enabled="true">
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
    </TestPlan>
    <hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Thread Group" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <intProp name="LoopController.loops">-1</intProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">1000</stringProp>
        <stringProp name="ThreadGroup.ramp_time">0</stringProp>
        <longProp name="ThreadGroup.start_time">1501685832000</longProp>
        <longProp name="ThreadGroup.end_time">1501685832000</longProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
      </ThreadGroup>
      <hashTree>
        <AccessLogSampler guiclass="TestBeanGUI" testclass="AccessLogSampler" testname="Access Log Sampler" enabled="true">
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
          <stringProp name="domain">pablo-mel.load.lan</stringProp>
          <stringProp name="portString">443</stringProp>
          <boolProp name="imageParsing">false</boolProp>
          <stringProp name="parserClassName">org.apache.jmeter.protocol.http.util.accesslog.TCLogParser</stringProp>
          <stringProp name="logFile">/home/qateam/melloadtest/Do_NOT_DElete/access.log</stringProp>
          <stringProp name="protocol">https</stringProp>
        </AccessLogSampler>
        <hashTree/>
        <kg.apc.jmeter.reporters.LoadosophiaUploader guiclass="kg.apc.jmeter.reporters.LoadosophiaUploaderGui" testclass="kg.apc.jmeter.reporters.LoadosophiaUploader" testname="LoadosophiaUploader" enabled="true">
          <elementProp name="arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
          <stringProp name="classname">kg.apc.jmeter.reporters.LoadosophiaClient</stringProp>
          <stringProp name="project">pablo</stringProp>
          <stringProp name="uploadToken">LS0tLS1CRUdJTiBSU0EgUFJJVkFURSBLRVktLS0tLQ0KTUdNQ0FRQUNFUURpKzdLV2JZSnJoaDJKTExpMkNmaTVBZ01CQUFFQ0VBa1YvUE01VVRzTFRTRzdMczFRbUpFQw0KQ1FEclUzVWd0ajBuc1FJSkFQYnNtNnRTTlN1SkFna0F2aktaQTFSbnZ6RUNDUUQwYkNoNEFRdEN5UUlJY1NDLw0KTCtKcU8xUT0NCi0tLS0tRU5EIFJTQSBQUklW</stringProp>
          <stringProp name="color">green</stringProp>
          <boolProp name="useOnline">true</boolProp>
        </kg.apc.jmeter.reporters.LoadosophiaUploader>
        <hashTree/>
        <ResultCollector guiclass="StatVisualizer" testclass="ResultCollector" testname="Aggregate Report" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
        <ResultCollector guiclass="GraphVisualizer" testclass="ResultCollector" testname="Graph Results" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
        <ResultCollector guiclass="TableVisualizer" testclass="ResultCollector" testname="View Results in Table" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
        <kg.apc.jmeter.reporters.AutoStop guiclass="kg.apc.jmeter.reporters.AutoStopGui" testclass="kg.apc.jmeter.reporters.AutoStop" testname="jp@gc - AutoStop Listener" enabled="true">
          <stringProp name="avg_response_time">2000</stringProp>
          <stringProp name="avg_response_time_length">6</stringProp>
          <stringProp name="error_rate">50</stringProp>
          <stringProp name="error_rate_length">7</stringProp>
        </kg.apc.jmeter.reporters.AutoStop>
        <hashTree/>
        <kg.apc.jmeter.timers.VariableThroughputTimer guiclass="kg.apc.jmeter.timers.VariableThroughputTimerGui" testclass="kg.apc.jmeter.timers.VariableThroughputTimer" testname="jp@gc - Throughput Shaping Timer" enabled="true">
          <collectionProp name="load_profile">
            <collectionProp name="1543665537">
              <stringProp name="1572">15</stringProp>
              <stringProp name="1572">15</stringProp>
              <stringProp name="48873">180</stringProp>
            </collectionProp>
            <collectionProp name="-1145373406">
              <stringProp name="1">1</stringProp>
              <stringProp name="49586">200</stringProp>
              <stringProp name="51570">420</stringProp>
            </collectionProp>
          </collectionProp>
        </kg.apc.jmeter.timers.VariableThroughputTimer>
        <hashTree/>
      </hashTree>
    </hashTree>
    <WorkBench guiclass="WorkBenchGui" testclass="WorkBench" testname="WorkBench" enabled="true">
      <boolProp name="WorkBench.save">true</boolProp>
    </WorkBench>
    <hashTree/>
  </hashTree>
</jmeterTestPlan>